dgkhoa25/nRF51822_BLE_App_UART_Custom_Service/main.c
static void cus_data_handler2(ble_cus_t * p_cus, uint8_t * p_data, uint16_t length)
{
		printf("Service 2: \r\n");
    for (uint32_t i = 0; i < length; i++)
    {
        while (app_uart_put(p_data[i]) != NRF_SUCCESS);
    }
    while (app_uart_put('\r') != NRF_SUCCESS);
    while (app_uart_put('\n') != NRF_SUCCESS);
}




/**@snippet [Handling the data received over BLE] */

uint8_t flag = 0;
// Prepare the response.
char data[21];
ble_gatts_rw_authorize_reply_params_t auth_reply = {0};

/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_cus_evt_handler(ble_cus_t   *p_cus_service, ble_cus_evt_t   *p_evt)
{

    switch(p_evt->evt_type)
    {
        case BLE_CUS_EVT_NOTIFICATION_ENABLED:
						printf("BLE_CUS_EVT_NOTIFICATION_ENABLED\r\n");
						flag = 1;
            break;

        case BLE_CUS_EVT_NOTIFICATION_DISABLED:
						printf("BLE_CUS_EVT_NOTIFICATION_DISABLED\r\n");
						flag = 0;
            break;

        case BLE_CUS_EVT_CONNECTED :
						printf("BLE_CUS_EVT_CONNECTED\r\n");
            break;

        case BLE_CUS_EVT_DISCONNECTED:
						printf("BLE_CUS_EVT_DISCONNECTED\r\n");
            break;

				case BLE_CUS_EVT_READ:
						printf("BLE_CUS_EVT_READ\r\n");
						memset(data, 0, 21);

						sprintf(data, "%s", "Truong Bach Khoa");
				
						auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
						auth_reply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
						auth_reply.params.read.update = 0x01;
						auth_reply.params.read.len = strlen((char *)data);
						auth_reply.params.read.p_data = (uint8_t*)data;
						sd_ble_gatts_rw_authorize_reply(p_cus_service->conn_handle,&auth_reply);
            break;
				
        default:
              // No implementation needed.
              break;
    }
}

static void on_cus_evt_handler2(ble_cus_t   *p_cus_service, ble_cus_evt_t   *p_evt)
{

    switch(p_evt->evt_type)
    {
        case BLE_CUS_EVT_NOTIFICATION_ENABLED:
						printf("BLE_CUS_EVT_NOTIFICATION_ENABLED 2 \r\n");
						flag = 1;
            break;

        case BLE_CUS_EVT_NOTIFICATION_DISABLED:
						printf("BLE_CUS_EVT_NOTIFICATION_DISABLED 2\r\n");
						flag = 0;
            break;

        case BLE_CUS_EVT_CONNECTED :
						printf("BLE_CUS_EVT_CONNECTED 2\r\n");
            break;

        case BLE_CUS_EVT_DISCONNECTED:
						printf("BLE_CUS_EVT_DISCONNECTED 2\r\n");
            break;

				case BLE_CUS_EVT_READ:
						printf("BLE_CUS_EVT_READ\r\n");
						memset(data, 0, 21);

						sprintf(data, "%s", "Dang Khoa");
				
						auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
						auth_reply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
						auth_reply.params.read.update = 0x01;
						auth_reply.params.read.len = strlen((char *)data);
						auth_reply.params.read.p_data = (uint8_t*)data;
						sd_ble_gatts_rw_authorize_reply(p_cus_service->conn_handle,&auth_reply);
            break;
				
        default:
              // No implementation needed.
              break;
    }
}



/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_cus_init_t cus_init;
		ble_cus_init_t cus_init2;

		// Initialize Service 1
    memset(&cus_init, 0, sizeof(cus_init));

		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.custom_value_char_attr_md.write_perm);
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.custom_value_char_attr_md.read_perm); // When enabling READ properties, we must enable the READ permission, if not is error
    cus_init.data_handler = cus_data_handler;
		// Set the cus event handler
    cus_init.evt_handler                = on_cus_evt_handler;
		cus_init.service_uuid 							= BLE_UUID_CUSTOM_SERVICE;
		cus_init.char_write_uuid									= BLE_UUID_CUSTOM_VAL_CHA_WRITE;
		cus_init.char_read_uuid									= BLE_UUID_CUSTOM_VAL_CHA_READ;
		cus_init.char_notify_uuid									= BLE_UUID_CUSTOM_VAL_CHA_NOTIFY;
    err_code = ble_cus_init(&m_cus, &cus_init);
	
		// Initialize Service 2
		memset(&cus_init2, 0, sizeof(cus_init));
		cus_init2.data_handler = cus_data_handler2;
		// Set the cus event handler
    cus_init2.evt_handler               = on_cus_evt_handler2;
		cus_init2.service_uuid							= BLE_UUID_CUSTOM_SERVICE_2;
		cus_init2.char_write_uuid						= BLE_UUID_CUSTOM_VAL_CHA_WRITE_2;
		cus_init2.char_read_uuid						= BLE_UUID_CUSTOM_VAL_CHA_READ_2;
		cus_init2.char_notify_uuid					= BLE_UUID_CUSTOM_VAL_CHA_NOTIFY_2;
		err_code = ble_cus_init(&m_cus2, &cus_init2);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

